# InvalidSketchForCeiling Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidSketchForCeiling Property
BuiltInFailures..::..SketchFailures Class See Also
---
Ceiling sketch is invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSketchForCeiling { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSketchForCeiling As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSketchForCeiling {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace